NIGRINISLUIS/DIPLOMADO_PROYECTO_FINAL_IOT/PROYECYO_FINAL_IoT__K32L2B31A_Project/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTB0 (number 35), J4[2]/A0/LCD_P0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_GPIOB0_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_GPIOB0_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_GPIOB0_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_GPIOB0_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_GPIOB0_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_GPIOB0_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTB1 (number 36), J4[4]/A1/LCD_P1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_GPIOB1_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_GPIOB1_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_GPIOB1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_GPIOB1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_GPIOB1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_GPIOB1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTC1 (number 44), J4[12]/A5/LCD_P21
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_GPIOC1_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_GPIOC1_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_GPIOC1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_GPIOC1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_GPIOC1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_GPIOC1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTC7 (number 56), J1[11]/USB_SOF_OUT/LCD_P27
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P27_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P27_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P27_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTC6 (number 55), J1[9]/LCD_P26
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P26_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P26_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P26_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTC4 (number 53), J1[7]/LCD_P24
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P24_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P24_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P24_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTC5 (number 54), J1[15]/INT1_ACCEL/LCD_P25
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INT1_ACCEL_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INT1_ACCEL_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INT1_ACCEL_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORTA13 (number 29), J2[2]/D8
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_GPIOA13_FGPIO FGPIOA              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_GPIOA13_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_GPIOA13_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_GPIOA13_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_GPIOA13_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_GPIOA13_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTD2 (number 59), J2[4]/D9/LCD_P42
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_GPIOD2_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_GPIOD2_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_GPIOD2_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_GPIOD2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_GPIOD2_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_GPIOD2_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTD4 (number 61), J2[6]/D10/SPI1_PCS0/LCD_P44
  @{ */

