NIGRINISLUIS/DIPLOMADO_PROYECTO_FINAL_IOT/PROYECYO_FINAL_IoT__K32L2B31A_Project/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_GPIOD4_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_GPIOD4_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_GPIOD4_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_GPIOD4_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_GPIOD4_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_GPIOD4_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTD6 (number 63), J2[8]/D11/SPI1_MOSI/LCD_P46
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_GPIOD6_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_GPIOD6_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_GPIOD6_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_GPIOD6_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_GPIOD6_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_GPIOD6_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTD7 (number 64), J2[10]/D12/SPI1_MISO/LCD_P47
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_GPIOD7_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_GPIOD7_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_GPIOD7_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_GPIOD7_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_GPIOD7_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_GPIOD7_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTB3 (number 38), J4[8]/A3/LCD_P3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_GPIOB3_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_GPIOB3_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_GPIOB3_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_GPIOB3_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_GPIOB3_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_GPIOB3_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTE0 (number 1), J2[18]/J4[9]/D14/I2C1_SDA/CMP0_OUT/LCD_P48
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_GPIOE0_FGPIO FGPIOE             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_GPIOE0_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define BOARD_GPIOE0_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_GPIOE0_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_GPIOE0_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_GPIOE0_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLCDPins(void);

/*! @name PORTA4 (number 26), J1[10]/D4/SW1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW1_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_SW1_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW1_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW1_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_SW1_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_SW1_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTC3 (number 46), SW3/LLWU_P7/LCD_P23
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW3_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_SW3_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW3_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW3_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_SW3_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_SW3_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONSPins(void);

/*! @name PORTE31 (number 19), LED2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LED2_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_LED2_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED2_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED2_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_LED2_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_LED2_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTD5 (number 62), J2[12]/D13/SPI1_SCK/LED1/LCD_P45
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LED1_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_LED1_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED1_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED1_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_LED1_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_LED1_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);

#define SOPT5_LPUART0RXSRC_LPUART_RX 0x00u /*!<@brief LPUART0 Receive Data Source Select: LPUART_RX pin */
#define SOPT5_LPUART0TXSRC_LPUART_TX 0x00u /*!<@brief LPUART0 Transmit Data Source Select: LPUART0_TX pin */

